# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.
# 4 4 -> 2 2
# 5 6 -> 2 3


s = int(input('Введите сумму чисел: '))
p = int(input('Введите произведение чисел: '))
c = 0
i = 0
j = 0

for i in range(s + p):
    if c:
        break
    for j in range(s + p):
        if i + j == s and i * j == p and i <= 1000 and j <= 1000:
            c = 1
            print(f'X = {i} Y = {j}')
            break
